ziteh/stm32-oop-lib/include/stm32_oop_lib_pwm.h
/**
 * @file   stm32_oop_lib_pwm.h
 * @author ZiTe (honmonoh@gmail.com)
 * @brief  This file is part of the 'STM32 OOP Library (stm32_oop_lib)' project.
 */

#ifndef STM32_OOP_LIB_PWM_H_
#define STM32_OOP_LIB_PWM_H_

#include "stm32_oop_lib_gpio.h"

namespace stm32_oop_lib
{
  typedef enum
  {
    CH1 = 1,
    CH2,
    CH3,
    CH4
  } PWM_TimerChannelTypeDef;

  class PWM
  {
  private:
    GPIOPortPin _Port_Pin;
    TIM_TypeDef *_Timer;
    PWM_TimerChannelTypeDef _Channel;
    TIM_TimeBaseInitTypeDef _TIM_TimeBaseStructure;
    TIM_OCInitTypeDef _TIM_OCInitStructure;
    RCC_ClocksTypeDef _RCC_Clocks;

    void Init_Timer(void);
    uint16_t ConvertDutyCycleToPulse(uint16_t dutyCycle);

  public:
    float FrequencyOffset = 0.0;
    float DutyCycleOffset = 0.0;

    PWM(GPIO_PortPinTypeDef portPin,
        TIM_TypeDef *Timer,
        PWM_TimerChannelTypeDef channel);
    void Init(RCC_ClocksTypeDef RCC_Clocks);

    void Enable(void);
    void Disable(void);

    void Set_Frequency(uint16_t frequency);
    void Set_DutyCycle(uint16_t value);

    uint16_t Get_Frequency(void);
    uint16_t Get_DutyCycle(void);
  };
}

#endif /* STM32_OOP_LIB_PWM_H_ */
